fio-l2p-cache-randread-4k-1G/fio_test_20260226_055221.log
=== 测试开始于 Thu Feb 26 05:52:21 UTC 2026 ===
=== 测试配置 ===
DEV: /dev/nvme0n1
OFFSET: 1G
SIZE: 1G
日志文件: /home/g122622/exp_results/fio_test_20260226_055221.log
================================
=== 开始预填充 (Pre-conditioning) ===
pre: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

pre: (groupid=0, jobs=1): err= 0: pid=1147: Thu Feb 26 05:52:24 2026
  write: IOPS=75.9k, BW=297MiB/s (311MB/s)(1024MiB/3453msec); 0 zone resets
    slat (nsec): min=549, max=2610.0k, avg=9269.53, stdev=8770.67
    clat (usec): min=532, max=3956, avg=833.26, stdev=93.35
     lat (usec): min=796, max=3966, avg=842.61, stdev=93.56
    clat percentiles (usec):
     |  1.00th=[  791],  5.00th=[  791], 10.00th=[  799], 20.00th=[  799],
     | 30.00th=[  807], 40.00th=[  807], 50.00th=[  816], 60.00th=[  816],
     | 70.00th=[  824], 80.00th=[  840], 90.00th=[  881], 95.00th=[  938],
     | 99.00th=[ 1139], 99.50th=[ 1254], 99.90th=[ 1958], 99.95th=[ 2671],
     | 99.99th=[ 3851]
   bw (  KiB/s): min=300031, max=304159, per=99.83%, avg=303158.33, stdev=1576.11, samples=6
   iops        : min=75007, max=76039, avg=75789.33, stdev=394.23, samples=6
  lat (usec)   : 750=0.10%, 1000=97.22%
  lat (msec)   : 2=2.58%, 4=0.10%
  cpu          : usr=7.36%, sys=73.73%, ctx=26250, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=297MiB/s (311MB/s), 297MiB/s-297MiB/s (311MB/s-311MB/s), io=1024MiB (1074MB), run=3453-3453msec

Disk stats (read/write):
  nvme0n1: ios=48/257917, merge=0/0, ticks=1/208910, in_queue=208911, util=97.45%
=== 开始 QD 扫描测试 ===
--- Testing QD=1 ---
test_qd1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 1 process

test_qd1: (groupid=0, jobs=1): err= 0: pid=1164: Thu Feb 26 05:52:27 2026
  read: IOPS=8858, BW=34.6MiB/s (36.3MB/s)(104MiB/3001msec)
    slat (usec): min=7, max=1294, avg= 9.23, stdev=11.83
    clat (nsec): min=312, max=1013.9k, avg=103046.08, stdev=62995.53
     lat (usec): min=43, max=1338, avg=112.36, stdev=63.76
    clat percentiles (usec):
     |  1.00th=[   35],  5.00th=[   38], 10.00th=[   42], 20.00th=[   43],
     | 30.00th=[   43], 40.00th=[   44], 50.00th=[   63], 60.00th=[  163],
     | 70.00th=[  163], 80.00th=[  163], 90.00th=[  165], 95.00th=[  165],
     | 99.00th=[  198], 99.50th=[  239], 99.90th=[  338], 99.95th=[  404],
     | 99.99th=[  881]
   bw (  KiB/s): min=35072, max=35496, per=99.80%, avg=35363.40, stdev=169.52, samples=5
   iops        : min= 8768, max= 8874, avg=8840.80, stdev=42.35, samples=5
  lat (nsec)   : 500=0.03%, 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.06%, 4=0.02%, 10=0.01%, 20=0.10%, 50=48.95%
  lat (usec)   : 100=1.08%, 250=49.34%, 500=0.36%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=1.47%, sys=14.33%, ctx=26538, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=26583,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=34.6MiB/s (36.3MB/s), 34.6MiB/s-34.6MiB/s (36.3MB/s-36.3MB/s), io=104MiB (109MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=25680/0, merge=0/0, ticks=2671/0, in_queue=2671, util=96.93%

--- Testing QD=2 ---
test_qd2: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
fio-3.28
Starting 1 process

test_qd2: (groupid=0, jobs=1): err= 0: pid=1174: Thu Feb 26 05:52:31 2026
  read: IOPS=17.5k, BW=68.5MiB/s (71.8MB/s)(205MiB/3001msec)
    slat (nsec): min=890, max=805896, avg=8776.71, stdev=7459.96
    clat (nsec): min=265, max=2100.4k, avg=104775.80, stdev=64084.93
     lat (usec): min=44, max=2122, avg=113.64, stdev=64.62
    clat percentiles (usec):
     |  1.00th=[   36],  5.00th=[   39], 10.00th=[   41], 20.00th=[   43],
     | 30.00th=[   44], 40.00th=[   47], 50.00th=[   64], 60.00th=[  163],
     | 70.00th=[  165], 80.00th=[  165], 90.00th=[  169], 95.00th=[  172],
     | 99.00th=[  192], 99.50th=[  229], 99.90th=[  334], 99.95th=[  420],
     | 99.99th=[  922]
   bw (  KiB/s): min=69776, max=70648, per=100.00%, avg=70273.60, stdev=363.56, samples=5
   iops        : min=17444, max=17662, avg=17568.40, stdev=90.89, samples=5
  lat (nsec)   : 500=0.01%, 750=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.06%, 50=44.04%
  lat (usec)   : 100=6.43%, 250=49.09%, 500=0.33%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=3.87%, sys=24.30%, ctx=43717, majf=0, minf=14
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=52602,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
   READ: bw=68.5MiB/s (71.8MB/s), 68.5MiB/s-68.5MiB/s (71.8MB/s-71.8MB/s), io=205MiB (215MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=50812/0, merge=0/0, ticks=5332/0, in_queue=5333, util=96.80%

--- Testing QD=4 ---
test_qd4: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
fio-3.28
Starting 1 process

test_qd4: (groupid=0, jobs=1): err= 0: pid=1184: Thu Feb 26 05:52:34 2026
  read: IOPS=34.2k, BW=134MiB/s (140MB/s)(401MiB/3001msec)
    slat (nsec): min=605, max=1643.4k, avg=8769.78, stdev=7447.68
    clat (nsec): min=263, max=1793.2k, avg=107554.65, stdev=64723.48
     lat (usec): min=43, max=1836, avg=116.41, stdev=65.05
    clat percentiles (usec):
     |  1.00th=[   36],  5.00th=[   38], 10.00th=[   41], 20.00th=[   43],
     | 30.00th=[   47], 40.00th=[   52], 50.00th=[   93], 60.00th=[  161],
     | 70.00th=[  163], 80.00th=[  167], 90.00th=[  174], 95.00th=[  180],
     | 99.00th=[  202], 99.50th=[  237], 99.90th=[  363], 99.95th=[  457],
     | 99.99th=[ 1483]
   bw (  KiB/s): min=136816, max=138336, per=100.00%, avg=137582.40, stdev=623.55, samples=5
   iops        : min=34204, max=34584, avg=34395.60, stdev=155.89, samples=5
  lat (nsec)   : 500=0.01%
  lat (usec)   : 10=0.01%, 20=0.04%, 50=35.62%, 100=14.39%, 250=49.55%
  lat (usec)   : 500=0.36%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=5.77%, sys=42.97%, ctx=57067, majf=0, minf=17
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=102772,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=134MiB/s (140MB/s), 134MiB/s-134MiB/s (140MB/s-140MB/s), io=401MiB (421MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=99282/0, merge=0/0, ticks=10541/0, in_queue=10541, util=96.80%

--- Testing QD=6 ---
test_qd6: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=6
fio-3.28
Starting 1 process

test_qd6: (groupid=0, jobs=1): err= 0: pid=1194: Thu Feb 26 05:52:37 2026
  read: IOPS=49.5k, BW=193MiB/s (203MB/s)(581MiB/3001msec)
    slat (nsec): min=610, max=1682.5k, avg=9061.34, stdev=7567.93
    clat (nsec): min=281, max=2532.2k, avg=111582.86, stdev=66955.08
     lat (usec): min=43, max=2541, avg=120.74, stdev=67.53
    clat percentiles (usec):
     |  1.00th=[   36],  5.00th=[   38], 10.00th=[   41], 20.00th=[   46],
     | 30.00th=[   51], 40.00th=[   58], 50.00th=[  145], 60.00th=[  161],
     | 70.00th=[  167], 80.00th=[  172], 90.00th=[  180], 95.00th=[  188],
     | 99.00th=[  229], 99.50th=[  273], 99.90th=[  396], 99.95th=[  461],
     | 99.99th=[ 1696]
   bw (  KiB/s): min=194304, max=201312, per=100.00%, avg=198521.60, stdev=2634.51, samples=5
   iops        : min=48576, max=50328, avg=49630.40, stdev=658.63, samples=5
  lat (nsec)   : 500=0.01%
  lat (usec)   : 10=0.01%, 20=0.03%, 50=29.22%, 100=20.23%, 250=49.80%
  lat (usec)   : 500=0.69%, 750=0.02%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=7.03%, sys=58.27%, ctx=53814, majf=0, minf=17
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=148621,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=6

Run status group 0 (all jobs):
   READ: bw=193MiB/s (203MB/s), 193MiB/s-193MiB/s (203MB/s-203MB/s), io=581MiB (609MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=143581/0, merge=0/0, ticks=15466/0, in_queue=15467, util=96.90%

--- Testing QD=8 ---
test_qd8: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.28
Starting 1 process

test_qd8: (groupid=0, jobs=1): err= 0: pid=1204: Thu Feb 26 05:52:40 2026
  read: IOPS=63.9k, BW=250MiB/s (262MB/s)(749MiB/3001msec)
    slat (nsec): min=541, max=1674.7k, avg=9215.15, stdev=7519.20
    clat (usec): min=9, max=2343, avg=115.53, stdev=68.62
     lat (usec): min=43, max=2379, avg=124.84, stdev=69.05
    clat percentiles (usec):
     |  1.00th=[   36],  5.00th=[   39], 10.00th=[   42], 20.00th=[   48],
     | 30.00th=[   55], 40.00th=[   64], 50.00th=[  145], 60.00th=[  163],
     | 70.00th=[  169], 80.00th=[  176], 90.00th=[  186], 95.00th=[  194],
     | 99.00th=[  241], 99.50th=[  293], 99.90th=[  437], 99.95th=[  498],
     | 99.99th=[ 1696]
   bw (  KiB/s): min=253464, max=258424, per=99.98%, avg=255505.60, stdev=2030.94, samples=5
   iops        : min=63366, max=64604, avg=63876.40, stdev=506.57, samples=5
  lat (usec)   : 10=0.01%, 20=0.01%, 50=23.68%, 100=25.68%, 250=49.75%
  lat (usec)   : 500=0.82%, 750=0.03%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=8.73%, sys=68.40%, ctx=42731, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=191724,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=250MiB/s (262MB/s), 250MiB/s-250MiB/s (262MB/s-262MB/s), io=749MiB (785MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=185179/0, merge=0/0, ticks=20132/0, in_queue=20133, util=96.96%

--- Testing QD=10 ---
test_qd10: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=10
fio-3.28
Starting 1 process

test_qd10: (groupid=0, jobs=1): err= 0: pid=1216: Thu Feb 26 05:52:44 2026
  read: IOPS=76.3k, BW=298MiB/s (313MB/s)(895MiB/3001msec)
    slat (nsec): min=565, max=1902.0k, avg=9542.92, stdev=9142.79
    clat (usec): min=9, max=2212, avg=121.00, stdev=69.01
     lat (usec): min=43, max=2224, avg=130.64, stdev=69.66
    clat percentiles (usec):
     |  1.00th=[   37],  5.00th=[   41], 10.00th=[   46], 20.00th=[   53],
     | 30.00th=[   61], 40.00th=[   72], 50.00th=[  149], 60.00th=[  165],
     | 70.00th=[  172], 80.00th=[  182], 90.00th=[  194], 95.00th=[  204],
     | 99.00th=[  260], 99.50th=[  314], 99.90th=[  437], 99.95th=[  502],
     | 99.99th=[ 1860]
   bw (  KiB/s): min=300960, max=308800, per=99.94%, avg=305035.20, stdev=2838.55, samples=5
   iops        : min=75240, max=77200, avg=76258.80, stdev=709.64, samples=5
  lat (usec)   : 10=0.01%, 20=0.01%, 50=17.04%, 100=31.47%, 250=50.35%
  lat (usec)   : 500=1.09%, 750=0.04%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=9.03%, sys=77.90%, ctx=27602, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=228993,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=10

Run status group 0 (all jobs):
   READ: bw=298MiB/s (313MB/s), 298MiB/s-298MiB/s (313MB/s-313MB/s), io=895MiB (938MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=220843/0, merge=0/0, ticks=24070/0, in_queue=24069, util=96.80%

--- Testing QD=12 ---
test_qd12: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=12
fio-3.28
Starting 1 process

test_qd12: (groupid=0, jobs=1): err= 0: pid=1226: Thu Feb 26 05:52:47 2026
  read: IOPS=85.1k, BW=332MiB/s (349MB/s)(998MiB/3001msec)
    slat (nsec): min=541, max=1811.2k, avg=9709.85, stdev=8804.04
    clat (usec): min=18, max=2147, avg=130.76, stdev=70.35
     lat (usec): min=43, max=2156, avg=140.57, stdev=71.00
    clat percentiles (usec):
     |  1.00th=[   39],  5.00th=[   47], 10.00th=[   54], 20.00th=[   63],
     | 30.00th=[   73], 40.00th=[   85], 50.00th=[  137], 60.00th=[  169],
     | 70.00th=[  182], 80.00th=[  192], 90.00th=[  206], 95.00th=[  219],
     | 99.00th=[  285], 99.50th=[  347], 99.90th=[  486], 99.95th=[  545],
     | 99.99th=[ 1844]
   bw (  KiB/s): min=337456, max=345184, per=100.00%, avg=342488.00, stdev=3045.82, samples=5
   iops        : min=84364, max=86296, avg=85622.00, stdev=761.45, samples=5
  lat (usec)   : 20=0.01%, 50=8.19%, 100=38.48%, 250=51.58%, 500=1.67%
  lat (usec)   : 750=0.07%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=8.70%, sys=85.83%, ctx=11708, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=255429,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=12

Run status group 0 (all jobs):
   READ: bw=332MiB/s (349MB/s), 332MiB/s-332MiB/s (349MB/s-349MB/s), io=998MiB (1046MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=246567/0, merge=0/0, ticks=26839/0, in_queue=26838, util=96.80%

--- Testing QD=14 ---
test_qd14: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=14
fio-3.28
Starting 1 process

test_qd14: (groupid=0, jobs=1): err= 0: pid=1236: Thu Feb 26 05:52:50 2026
  read: IOPS=90.7k, BW=354MiB/s (371MB/s)(1063MiB/3001msec)
    slat (nsec): min=564, max=1700.9k, avg=9829.29, stdev=8175.88
    clat (usec): min=22, max=2031, avg=144.03, stdev=69.48
     lat (usec): min=43, max=2043, avg=153.96, stdev=70.05
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   57], 10.00th=[   65], 20.00th=[   78],
     | 30.00th=[   89], 40.00th=[  104], 50.00th=[  139], 60.00th=[  180],
     | 70.00th=[  194], 80.00th=[  206], 90.00th=[  223], 95.00th=[  235],
     | 99.00th=[  289], 99.50th=[  334], 99.90th=[  461], 99.95th=[  537],
     | 99.99th=[ 1876]
   bw (  KiB/s): min=356720, max=366984, per=99.98%, avg=362652.20, stdev=4104.50, samples=5
   iops        : min=89180, max=91746, avg=90663.00, stdev=1026.15, samples=5
  lat (usec)   : 50=2.69%, 100=35.18%, 250=59.45%, 500=2.61%, 750=0.04%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.01%
  cpu          : usr=9.00%, sys=89.20%, ctx=3270, majf=0, minf=25
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=272133,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=14

Run status group 0 (all jobs):
   READ: bw=354MiB/s (371MB/s), 354MiB/s-354MiB/s (371MB/s-371MB/s), io=1063MiB (1115MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=263090/0, merge=0/0, ticks=27997/0, in_queue=27997, util=96.80%

--- Testing QD=16 ---
test_qd16: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.28
Starting 1 process

test_qd16: (groupid=0, jobs=1): err= 0: pid=1246: Thu Feb 26 05:52:53 2026
  read: IOPS=92.6k, BW=362MiB/s (379MB/s)(1086MiB/3001msec)
    slat (nsec): min=539, max=1557.0k, avg=9808.03, stdev=8079.47
    clat (usec): min=20, max=2003, avg=162.39, stdev=70.93
     lat (usec): min=43, max=2012, avg=172.30, stdev=71.49
    clat percentiles (usec):
     |  1.00th=[   56],  5.00th=[   73], 10.00th=[   83], 20.00th=[   96],
     | 30.00th=[  109], 40.00th=[  123], 50.00th=[  163], 60.00th=[  196],
     | 70.00th=[  210], 80.00th=[  225], 90.00th=[  241], 95.00th=[  255],
     | 99.00th=[  318], 99.50th=[  367], 99.90th=[  519], 99.95th=[  570],
     | 99.99th=[ 1844]
   bw (  KiB/s): min=364568, max=376552, per=100.00%, avg=371235.20, stdev=4521.05, samples=5
   iops        : min=91142, max=94138, avg=92808.80, stdev=1130.26, samples=5
  lat (usec)   : 50=0.51%, 100=23.14%, 250=70.00%, 500=6.23%, 750=0.10%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.01%
  cpu          : usr=10.57%, sys=88.57%, ctx=849, majf=0, minf=27
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=277996,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=362MiB/s (379MB/s), 362MiB/s-362MiB/s (379MB/s-379MB/s), io=1086MiB (1139MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=268712/0, merge=0/0, ticks=28703/0, in_queue=28702, util=96.96%

--- Testing QD=18 ---
test_qd18: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=18
fio-3.28
Starting 1 process

test_qd18: (groupid=0, jobs=1): err= 0: pid=1256: Thu Feb 26 05:52:57 2026
  read: IOPS=92.0k, BW=359MiB/s (377MB/s)(1079MiB/3001msec)
    slat (nsec): min=531, max=1613.0k, avg=9908.73, stdev=8310.15
    clat (usec): min=27, max=2187, avg=185.13, stdev=77.61
     lat (usec): min=43, max=2188, avg=195.15, stdev=78.33
    clat percentiles (usec):
     |  1.00th=[   73],  5.00th=[   92], 10.00th=[  103], 20.00th=[  117],
     | 30.00th=[  129], 40.00th=[  145], 50.00th=[  184], 60.00th=[  217],
     | 70.00th=[  233], 80.00th=[  245], 90.00th=[  265], 95.00th=[  281],
     | 99.00th=[  375], 99.50th=[  449], 99.90th=[  709], 99.95th=[  857],
     | 99.99th=[ 2008]
   bw (  KiB/s): min=356360, max=377208, per=100.00%, avg=369230.40, stdev=8171.61, samples=5
   iops        : min=89090, max=94302, avg=92307.60, stdev=2042.90, samples=5
  lat (usec)   : 50=0.06%, 100=8.44%, 250=74.48%, 500=16.70%, 750=0.24%
  lat (usec)   : 1000=0.05%
  lat (msec)   : 2=0.03%, 4=0.01%
  cpu          : usr=9.60%, sys=89.67%, ctx=383, majf=0, minf=29
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=276184,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=18

Run status group 0 (all jobs):
   READ: bw=359MiB/s (377MB/s), 359MiB/s-359MiB/s (377MB/s-377MB/s), io=1079MiB (1131MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=266961/0, merge=0/0, ticks=28716/0, in_queue=28716, util=96.80%

--- Testing QD=20 ---
test_qd20: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=20
fio-3.28
Starting 1 process

test_qd20: (groupid=0, jobs=1): err= 0: pid=1266: Thu Feb 26 05:53:00 2026
  read: IOPS=89.9k, BW=351MiB/s (368MB/s)(1054MiB/3001msec)
    slat (nsec): min=535, max=1633.7k, avg=10154.04, stdev=10469.17
    clat (usec): min=29, max=2155, avg=211.73, stdev=82.97
     lat (usec): min=45, max=2163, avg=221.99, stdev=83.94
    clat percentiles (usec):
     |  1.00th=[   94],  5.00th=[  115], 10.00th=[  126], 20.00th=[  141],
     | 30.00th=[  153], 40.00th=[  169], 50.00th=[  210], 60.00th=[  241],
     | 70.00th=[  258], 80.00th=[  273], 90.00th=[  289], 95.00th=[  318],
     | 99.00th=[  478], 99.50th=[  570], 99.90th=[  734], 99.95th=[  799],
     | 99.99th=[ 1942]
   bw (  KiB/s): min=346600, max=376040, per=100.00%, avg=360083.60, stdev=10813.88, samples=5
   iops        : min=86650, max=94010, avg=90020.80, stdev=2703.48, samples=5
  lat (usec)   : 50=0.02%, 100=1.60%, 250=63.54%, 500=34.02%, 750=0.75%
  lat (usec)   : 1000=0.06%
  lat (msec)   : 2=0.02%, 4=0.01%
  cpu          : usr=9.73%, sys=89.77%, ctx=286, majf=0, minf=30
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=269810,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=20

Run status group 0 (all jobs):
   READ: bw=351MiB/s (368MB/s), 351MiB/s-351MiB/s (368MB/s-368MB/s), io=1054MiB (1105MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=260886/0, merge=0/0, ticks=28376/0, in_queue=28376, util=97.06%

--- Testing QD=22 ---
test_qd22: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=22
fio-3.28
Starting 1 process

test_qd22: (groupid=0, jobs=1): err= 0: pid=1276: Thu Feb 26 05:53:03 2026
  read: IOPS=92.7k, BW=362MiB/s (380MB/s)(1087MiB/3001msec)
    slat (nsec): min=544, max=2057.8k, avg=9846.58, stdev=8880.61
    clat (usec): min=27, max=2695, avg=226.96, stdev=79.09
     lat (usec): min=44, max=2704, avg=236.92, stdev=79.83
    clat percentiles (usec):
     |  1.00th=[  111],  5.00th=[  135], 10.00th=[  145], 20.00th=[  159],
     | 30.00th=[  169], 40.00th=[  186], 50.00th=[  227], 60.00th=[  260],
     | 70.00th=[  273], 80.00th=[  289], 90.00th=[  306], 95.00th=[  326],
     | 99.00th=[  429], 99.50th=[  494], 99.90th=[  701], 99.95th=[  775],
     | 99.99th=[ 2212]
   bw (  KiB/s): min=364576, max=374344, per=100.00%, avg=371227.20, stdev=3870.58, samples=5
   iops        : min=91144, max=93586, avg=92806.80, stdev=967.65, samples=5
  lat (usec)   : 50=0.02%, 100=0.55%, 250=54.97%, 500=44.00%, 750=0.40%
  lat (usec)   : 1000=0.04%
  lat (msec)   : 2=0.01%, 4=0.02%
  cpu          : usr=9.70%, sys=89.67%, ctx=322, majf=0, minf=32
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=278149,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=22

Run status group 0 (all jobs):
   READ: bw=362MiB/s (380MB/s), 362MiB/s-362MiB/s (380MB/s-380MB/s), io=1087MiB (1139MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=268563/0, merge=0/0, ticks=28866/0, in_queue=28867, util=96.96%

--- Testing QD=24 ---
test_qd24: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=24
fio-3.28
Starting 1 process

test_qd24: (groupid=0, jobs=1): err= 0: pid=1286: Thu Feb 26 05:53:06 2026
  read: IOPS=93.6k, BW=366MiB/s (383MB/s)(1097MiB/3001msec)
    slat (nsec): min=534, max=1748.0k, avg=9774.53, stdev=8561.20
    clat (usec): min=34, max=2187, avg=246.09, stdev=78.12
     lat (usec): min=50, max=2196, avg=255.97, stdev=78.75
    clat percentiles (usec):
     |  1.00th=[  130],  5.00th=[  153], 10.00th=[  163], 20.00th=[  178],
     | 30.00th=[  190], 40.00th=[  206], 50.00th=[  243], 60.00th=[  281],
     | 70.00th=[  293], 80.00th=[  310], 90.00th=[  326], 95.00th=[  343],
     | 99.00th=[  433], 99.50th=[  494], 99.90th=[  742], 99.95th=[  865],
     | 99.99th=[ 2089]
   bw (  KiB/s): min=370608, max=376576, per=99.71%, avg=373304.20, stdev=2602.69, samples=5
   iops        : min=92652, max=94144, avg=93326.00, stdev=650.63, samples=5
  lat (usec)   : 50=0.01%, 100=0.27%, 250=50.57%, 500=48.69%, 750=0.38%
  lat (usec)   : 1000=0.06%
  lat (msec)   : 2=0.01%, 4=0.02%
  cpu          : usr=9.73%, sys=89.90%, ctx=213, majf=0, minf=34
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=280878,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=24

Run status group 0 (all jobs):
   READ: bw=366MiB/s (383MB/s), 366MiB/s-366MiB/s (383MB/s-383MB/s), io=1097MiB (1150MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=271201/0, merge=0/0, ticks=29068/0, in_queue=29068, util=96.86%

--- Testing QD=26 ---
test_qd26: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=26
fio-3.28
Starting 1 process

test_qd26: (groupid=0, jobs=1): err= 0: pid=1296: Thu Feb 26 05:53:09 2026
  read: IOPS=93.4k, BW=365MiB/s (383MB/s)(1095MiB/3001msec)
    slat (nsec): min=533, max=1660.1k, avg=9805.68, stdev=8706.95
    clat (usec): min=36, max=2173, avg=268.03, stdev=81.73
     lat (usec): min=48, max=2181, avg=277.95, stdev=82.41
    clat percentiles (usec):
     |  1.00th=[  143],  5.00th=[  172], 10.00th=[  184], 20.00th=[  198],
     | 30.00th=[  212], 40.00th=[  229], 50.00th=[  269], 60.00th=[  302],
     | 70.00th=[  314], 80.00th=[  330], 90.00th=[  351], 95.00th=[  371],
     | 99.00th=[  465], 99.50th=[  529], 99.90th=[  742], 99.95th=[  971],
     | 99.99th=[ 2114]
   bw (  KiB/s): min=370256, max=380888, per=100.00%, avg=374665.60, stdev=5002.10, samples=5
   iops        : min=92564, max=95222, avg=93666.40, stdev=1250.52, samples=5
  lat (usec)   : 50=0.01%, 100=0.26%, 250=46.75%, 500=52.32%, 750=0.56%
  lat (usec)   : 1000=0.05%
  lat (msec)   : 2=0.03%, 4=0.02%
  cpu          : usr=10.10%, sys=89.43%, ctx=254, majf=0, minf=35
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=280274,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=26

Run status group 0 (all jobs):
   READ: bw=365MiB/s (383MB/s), 365MiB/s-365MiB/s (383MB/s-383MB/s), io=1095MiB (1148MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=270982/0, merge=0/0, ticks=29143/0, in_queue=29143, util=96.93%

--- Testing QD=28 ---
test_qd28: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=28
fio-3.28
Starting 1 process

test_qd28: (groupid=0, jobs=1): err= 0: pid=1306: Thu Feb 26 05:53:13 2026
  read: IOPS=93.8k, BW=367MiB/s (384MB/s)(1100MiB/3001msec)
    slat (nsec): min=534, max=1676.7k, avg=9757.74, stdev=8089.57
    clat (usec): min=40, max=2798, avg=288.04, stdev=83.80
     lat (usec): min=50, max=2820, avg=297.91, stdev=84.40
    clat percentiles (usec):
     |  1.00th=[  167],  5.00th=[  192], 10.00th=[  204], 20.00th=[  219],
     | 30.00th=[  231], 40.00th=[  247], 50.00th=[  289], 60.00th=[  322],
     | 70.00th=[  334], 80.00th=[  351], 90.00th=[  367], 95.00th=[  388],
     | 99.00th=[  486], 99.50th=[  553], 99.90th=[  848], 99.95th=[ 1029],
     | 99.99th=[ 2278]
   bw (  KiB/s): min=371984, max=378467, per=99.96%, avg=375229.40, stdev=2612.08, samples=5
   iops        : min=92996, max=94616, avg=93807.20, stdev=652.79, samples=5
  lat (usec)   : 50=0.01%, 100=0.17%, 250=40.78%, 500=58.22%, 750=0.68%
  lat (usec)   : 1000=0.10%
  lat (msec)   : 2=0.02%, 4=0.03%
  cpu          : usr=7.57%, sys=91.97%, ctx=210, majf=0, minf=40
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=281617,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=28

Run status group 0 (all jobs):
   READ: bw=367MiB/s (384MB/s), 367MiB/s-367MiB/s (384MB/s-384MB/s), io=1100MiB (1154MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=271831/0, merge=0/0, ticks=29233/0, in_queue=29233, util=96.93%

--- Testing QD=30 ---
test_qd30: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=30
fio-3.28
Starting 1 process

test_qd30: (groupid=0, jobs=1): err= 0: pid=1316: Thu Feb 26 05:53:16 2026
  read: IOPS=94.4k, BW=369MiB/s (387MB/s)(1107MiB/3001msec)
    slat (nsec): min=528, max=1730.2k, avg=9705.14, stdev=7886.36
    clat (usec): min=41, max=2325, avg=307.54, stdev=80.01
     lat (usec): min=49, max=2334, avg=317.35, stdev=80.50
    clat percentiles (usec):
     |  1.00th=[  184],  5.00th=[  212], 10.00th=[  225], 20.00th=[  239],
     | 30.00th=[  253], 40.00th=[  269], 50.00th=[  306], 60.00th=[  343],
     | 70.00th=[  355], 80.00th=[  371], 90.00th=[  388], 95.00th=[  408],
     | 99.00th=[  490], 99.50th=[  537], 99.90th=[  750], 99.95th=[  971],
     | 99.99th=[ 2212]
   bw (  KiB/s): min=373320, max=381160, per=99.92%, avg=377273.60, stdev=3213.37, samples=5
   iops        : min=93330, max=95290, avg=94318.40, stdev=803.34, samples=5
  lat (usec)   : 50=0.01%, 100=0.13%, 250=28.49%, 500=70.52%, 750=0.75%
  lat (usec)   : 1000=0.05%
  lat (msec)   : 2=0.01%, 4=0.03%
  cpu          : usr=9.43%, sys=90.17%, ctx=183, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=283283,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=30

Run status group 0 (all jobs):
   READ: bw=369MiB/s (387MB/s), 369MiB/s-369MiB/s (387MB/s-387MB/s), io=1107MiB (1160MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=273474/0, merge=0/0, ticks=29336/0, in_queue=29336, util=96.83%

--- Testing QD=32 ---
test_qd32: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

test_qd32: (groupid=0, jobs=1): err= 0: pid=1326: Thu Feb 26 05:53:19 2026
  read: IOPS=93.7k, BW=366MiB/s (384MB/s)(1098MiB/3001msec)
    slat (nsec): min=533, max=1852.2k, avg=9780.61, stdev=8582.32
    clat (usec): min=38, max=7432, avg=331.13, stdev=110.88
     lat (usec): min=51, max=7432, avg=341.02, stdev=111.39
    clat percentiles (usec):
     |  1.00th=[  198],  5.00th=[  233], 10.00th=[  245], 20.00th=[  260],
     | 30.00th=[  273], 40.00th=[  293], 50.00th=[  330], 60.00th=[  363],
     | 70.00th=[  379], 80.00th=[  392], 90.00th=[  412], 95.00th=[  437],
     | 99.00th=[  545], 99.50th=[  619], 99.90th=[  979], 99.95th=[ 1434],
     | 99.99th=[ 6521]
   bw (  KiB/s): min=372464, max=381744, per=100.00%, avg=377616.00, stdev=3557.54, samples=5
   iops        : min=93116, max=95436, avg=94404.00, stdev=889.39, samples=5
  lat (usec)   : 50=0.01%, 100=0.11%, 250=13.51%, 500=84.62%, 750=1.57%
  lat (usec)   : 1000=0.10%
  lat (msec)   : 2=0.06%, 4=0.03%, 10=0.01%
  cpu          : usr=11.43%, sys=88.13%, ctx=167, majf=0, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=281195,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=366MiB/s (384MB/s), 366MiB/s-366MiB/s (384MB/s-384MB/s), io=1098MiB (1152MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=271789/0, merge=0/0, ticks=29292/0, in_queue=29292, util=96.93%

=== 测试完成于 Thu Feb 26 05:53:19 UTC 2026 ===
所有结果已保存到: /home/g122622/exp_results/fio_test_20260226_055221.log